def change(a, b, c):
 # Определяем функцию change, которая принимает три аргумента: a, b и c.
   d = []
   # Создаем пустой список d.
   d.append(a), d.append(b), d.append(c)
   # Добавляем в список d значения a, b и c.
   d.sort()
   # Сортируем список d по возрастанию. Теперь:
   # - d[0] содержит минимальный элемент
   # - d[1] содержит средний элемент
   # - d[2] содержит максимальный элемент
   start = d[1]
   # Присваиваем переменной start средний элемент из отсортированного списка d.
   end = d[2]
   # Присваиваем переменной end максимальный элемент из отсортированного списка d.
   step = d[0]
   # Присваиваем переменной step минимальный элемент из отсортированного списка d.
   arr = []
   # Создаем пустой список arr, в который будем добавлять элементы в следующем цикле.
   for i in range(start, end + 1, step):
       # Запускаем цикл от значения start до значения end (включительно), с шагом step.
       # i принимает значения start, start + step, ..., пока не превысит end.
       arr.append(i ** 2)
       # Возводим текущее значение i в квадрат (i ** 2) и добавляем этот результат в список arr.
   print(*arr)
   # Распечатываем элементы списка arr, используя распаковку списка (*), чтобы вывести элементы через пробел.
change(4, 14, 3)
# Вызываем функцию с аргументами a=4, b=14, c=3. Ожидаемый результат: 16, 49, 100, 169.

