def external(x):
   # Определяем функцию external, которая принимает одно значение x
   def inner(y):
       # Внутренняя функция inner, которая принимает одно значение y
       nonlocal x  # Используем nonlocal для доступа к переменной x из внешней функции
       if y == 0:
           # Если y равно 0, это условие означает, что нужно вернуть накопленное значение
           return x  # Возвращаем текущее значение x, которое было накоплено
       else:
           # Если y не равно 0, добавляем значение y к x
           x += y  # Увеличиваем значение x на значение y
           return inner  # Возвращаем внутреннюю функцию для следующего вызова
   return inner  # Возвращаем внутреннюю функцию, чтобы её можно было вызвать позже

#паттерн каррирования