Delete from ORDERS

INSERT INTO ORDERS(LOGIN_CLIENT, ADRESS_ACTUAL,DATA_DILIVERY, DATA_DIL_ACT)

VALUES 

('anton', 'г.Чебоксары, ул.Ленинского Комсомола, д.3,кв 491', '2025-10-17', '2025-10-18'),

('foma', 'г.Москва, ул.Ленина, д.85, кв. 15', '2025-10-19', '2025-10-22'),

('goblin', 'г.Москва, ул.Тверская, д.10/2, кв. 98', '2025-11-19', '2025-11-22'),

('nikita', 'г.Чаплыгин, ул.Пушкина, д.3, кв. 47', '2025-11-01', '2025-11-01'),

('platina', 'г.Рига, ул.Свега, д.26, кв. 71', '2025-11-15', '2025-11-16')

select * from ORDERS